Revit 2027 API
MEPSystem.HasFabricationParts Property
 Indicates if the system has one or more fabrication parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasFabricationParts { get; }
Public ReadOnly Property HasFabricationParts As Boolean
	Get
public:
property bool HasFabricationParts {
	bool get ();
}
member HasFabricationParts : bool with get
Property Value
Boolean
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace